<?php

use Illuminate\Database\Seeder;
use Carbon\Carbon;
use Spatie\Permission\Models\Role;

class RolePermissionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Role::findByName('التحكم-في-المستخدمين')->syncPermissions([
            'عرض مستخدم',
            'إضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',
        ]);
        
        Role::findByName('التحكم-في-العملاء')->syncPermissions([
            'عرض عميل',
            'إضافة عميل',
            'تعديل عميل',
        ]);

        Role::findByName('التحكم-في-الصلاحيات')->syncPermissions([
            'عرض صلاحية',
            'إضافة صلاحية',
            'تعديل صلاحية',
            'حذف الصلاحية',
        ]);

        Role::findByName('التحكم-في-الأقسام')->syncPermissions([
            'عرض قسم',
            'أضافة قسم',
            'تعديل قسم',
            'حذف القسم',
        ]);

        Role::findByName('التحكم-في-المنتجات')->syncPermissions([
            'عرض منتج',
            'إضافة منتج',
            'تعديل منتج',
            'حذف المنتج',
        ]);

        Role::findByName('التحكم-في-المنطقة')->syncPermissions([
            'عرض منطقة',
            'إضافة منطقة',
            'تعديل المنطقة',
            'حذف المنطقة',
        ]);

        Role::findByName('التحكم-في-الطاولة')->syncPermissions([
            'عرض طاولة',
            'إضافة طاولة',
            'تعديل طاولة',
            'حذف طاولة',
        ]);

        Role::findByName('التحكم-في-الطابق')->syncPermissions([
            'عرض طابق',
            'إضافة طابق',
            'تعديل طابق',
            'حذف الطابق',
        ]);
        Role::findByName('التحكم-في-الإعدادات')->syncPermissions([
            'عرض إعدادات',
            'إضافة إعدادات',
            'تعديل إعدادات',
            'حذف إعدادات',
        ]);

        Role::findByName('التحكم-في-التقارير')->syncPermissions([
            'عرض التقارير',
            'طباعة التقرير',
        ]);

        Role::findByName('التحكم-في-التكاليف')->syncPermissions([
            'عرض تكاليف غير مباشرة',
            'إضافة تكاليف غير مباشرة',
            'تعديل تكاليف غير مباشرة',
            'حذف تكاليف غير مباشرة',
            'عرض مصروفات غير مباشرة',
            'إضافة مصروفات غير مباشرة',
            'تعديل مصروفات غير مباشرة',
        ]);

        Role::findByName('التحكم-في-الطلبات')->syncPermissions([
            'عرض طلب',
            'إضافة طلب',
            'تعديل طلب',
            'إلغاء طلب',
            'تأكيد الدفع',
            'البحث عن عملاء',
        ]);

        Role::findByName('التحكم-في-تصنيع-المنتج')->syncPermissions([
            'عرض تصنيع منتج',
            'إضافة تصنيع منتج',
            'تعديل تصنيع منتج',
            'حذف تصنيع المنتج',
        ]);

        Role::findByName('التحكم-في-المواد-الخام')->syncPermissions([
            'عرض مواد خام',
            'إضافة مواد خام',
            'تعديل مواد خام',
            'حذف مواد خام',
        ]);

        Role::findByName('التحكم-في-المخزن')->syncPermissions([
            'عرض توريد للمخزن',
            'إضافة توريد للمخزن',
            'تعديل توريد للمخزن',
            'حذف توريد للمخزن',
            'عرض رصيد المخزن',
        ]);
        Role::findByName('التحكم-في-المواد-الخام')->syncPermissions([
            'عرض مواد خام',
            'إضافة مواد خام',
            'تعديل مواد خام',
            'حذف مواد خام',
        ]);
        Role::findByName('التحكم-في-التلفيات')->syncPermissions([
            'عرض تلفيات',
            'إضافة تلفيات',
            'تعديل تلفيات',
            'إلغاء تلفيات',
        ]);
    }
}
