<?php

use Illuminate\Database\Seeder;
use Carbon\Carbon;
use Spatie\Permission\Models\Role;

class RolePermissionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Role::findByName('كاشير')->syncPermissions([
            'عرض عميل',
            'إضافة عميل',
            'تعديل عميل',


            'عرض منطقة',
            'إضافة منطقة',
            'تعديل المنطقة',

            'عرض طابق',
            'إضافة طابق',
            'تعديل طابق',

            'عرض طاولة',
            'إضافة طاولة',
            'تعديل طاولة',

            'عرض طلب',
            'إضافة طلب',
            'تعديل طلب',
            'تأكيد الدفع',
            'البحث عن عملاء',   

        ]);
        
        Role::findByName('محاسب')->syncPermissions([
            'عرض عميل',
            'إضافة عميل',
            'تعديل عميل',

            'عرض منتج',
            'إضافة منتج',
            'تعديل منتج',

            'عرض منطقة',
            'إضافة منطقة',
            'تعديل المنطقة',

            'عرض طابق',
            'إضافة طابق',
            'تعديل طابق',

            'عرض طاولة',
            'إضافة طاولة',
            'تعديل طاولة',

            'عرض طلب',

            'عرض تكاليف غير مباشرة',
            'إضافة تكاليف غير مباشرة',
            'تعديل تكاليف غير مباشرة',
            'حذف تكاليف غير مباشرة',

            'عرض مصروفات غير مباشرة',
            'إضافة مصروفات غير مباشرة',
            'تعديل مصروفات غير مباشرة',

            'عرض تصنيع منتج',
            'إضافة تصنيع منتج',
            'تعديل تصنيع منتج',

            'عرض طلبية من المطبخ',
            'عرض توريد للمخزن',
        ]);

        Role::findByName('صاله مان')->syncPermissions([
            
            'عرض منتج',
            'عرض طابق',
            'عرض طاولة',

            'عرض طلب',
            'إضافة طلب',
            'تعديل طلب',

        ]);

        Role::findByName('مدير المخزن')->syncPermissions([
            
            'عرض تصنيع منتج',
            'عرض رصيد المخزن',

            'عرض طلبية من المطبخ',
            'إضافة طلبية من المطبخ',
            'تعديل طلبية من المطبخ',

            'عرض توريد للمخزن',
            'إضافة توريد للمخزن',
            'تعديل توريد للمخزن',
        ]);

        Role::findByName('الشيف')->syncPermissions([
            
            'عرض تصنيع منتج',
            'عرض رصيد المخزن',

            'عرض طلبية من المطبخ',
            'إضافة طلبية من المطبخ',
            'تعديل طلبية من المطبخ',

            'عرض تصنيع منتج',
            'إضافة تصنيع منتج',
            'تعديل تصنيع منتج',
        ]);

        Role::findByName('ديليفري مان')->syncPermissions([
            'عرض عميل',
            'عرض منطقة',
            'عرض طلب',
            'البحث عن عملاء',   
        ]);

        Role::findByName('صاحب الموقع')->syncPermissions([
            'عرض مستخدم',
            'إضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',

            'عرض عميل',
            'إضافة عميل',
            'تعديل عميل',
            'حذف عميل',

            'عرض صلاحية',
            'إضافة صلاحية',
            'تعديل صلاحية',
            'حذف الصلاحية',

            'عرض قسم',
            'أضافة قسم',
            'تعديل قسم',
            'حذف القسم',

            'عرض منتج',
            'إضافة منتج',
            'تعديل منتج',
            'حذف المنتج',

            'عرض منطقة',
            'إضافة منطقة',
            'تعديل المنطقة',
            'حذف المنطقة',

            'عرض طابق',
            'إضافة طابق',
            'تعديل طابق',
            'حذف الطابق',

            'عرض طاولة',
            'إضافة طاولة',
            'تعديل طاولة',
            'حذف طاولة',

            'عرض إعدادات',
            'إضافة إعدادات',
            'تعديل إعدادات',
            'حذف إعدادات',

            'عرض التقارير',
            'طباعة التقرير',
            
            'عرض تكاليف غير مباشرة',
            'إضافة تكاليف غير مباشرة',
            'تعديل تكاليف غير مباشرة',
            'حذف تكاليف غير مباشرة',

            'عرض مصروفات غير مباشرة',
            'إضافة مصروفات غير مباشرة',
            'تعديل مصروفات غير مباشرة',

            'عرض طلب',
            'إضافة طلب',
            'تعديل طلب',
            'إلغاء طلب',

            'عرض طلبية من المطبخ',
            'إضافة طلبية من المطبخ',
            'تعديل طلبية من المطبخ',
            'حذف طلبية من المطبخ',

            'تأكيد الدفع',
            'البحث عن عملاء',

            'عرض تصنيع منتج',
            'إضافة تصنيع منتج',
            'تعديل تصنيع منتج',
            'حذف تصنيع المنتج',

            'عرض مواد خام',
            'إضافة مواد خام',
            'تعديل مواد خام',
            'حذف مواد خام',

            'عرض توريد للمخزن',
            'إضافة توريد للمخزن',
            'تعديل توريد للمخزن',
            'حذف توريد للمخزن',

            'عرض قياس المواد الخام',
            'إضافة قياس المواد الخام',
            'تعديل قياس المواد الخام',
            'حذف قياس المواد الخام',


        ]);

    }
}
